package lesson3;

import java.util.Arrays;

public class Main {

	public static void main(String[] args) {

		int arrWithInt [] = {1,2,3,4,5,4,9,4};

//		Hw task0 Check number in array
//		System.out.println(Hw.checkNumInArray(arrWithInt));

//		Hw task1 Remove number from array
//		System.out.println(Arrays.toString(Hw.getArrayWithoutSelectedNumber(arrWithInt)));

//		Hw task2 Get min middle max values of random array
//		Hw.getBoundaryValuesOfArray();

//		Hw task3 Compare two arrays
//		Hw.getArraysComparison();

//		Hw task4 Get array with even numbers
//		Hw.getArrayWithEvenNumbers();

//		Hw task5 Get array with odd index
		Hw.getArrayWithOddIndex();

//		Hw task6 Get array with names
//		Hw.getArrayWithNames();

//	  	Hw.task7 Sorting
		Hw.sortArray();





	}


	/*c

5. Создайте массив и заполните массив.
Выведите массив на экран в строку.
Замените каждый элемент с нечётным индексом на ноль.
Снова выведете массив на экран на отдельной строке.

6. Создайте массив строк. Заполните его произвольными именами
людей.
Отсортируйте массив.
Результат выведите на консоль.

7.Реализуйте алгоритм сортировки (любой, кроме пузырька).*/
}
